var lookup = ["新北市","臺北市","桃園市","臺中市","臺南市","高雄市","宜蘭縣","新竹縣","苗栗縣","彰化縣","南投縣","雲林縣","嘉義縣","屏東縣","臺東縣","花蓮縣","澎湖縣","基隆市","新竹市","嘉義市","金門縣","連江縣"];

var offset = {
    "臺北市": {
        scale: 1.6,
        translate: [0.00, 0.08]
    },
    "基隆市": {
        scale: 1.4,
        translate: [0.21, -0.05]
    },
    "新竹市": {
        scale: 2.1,
        translate: [-0.02, -0.05]
    },
    "嘉義市": {
        scale: 2.5,
        translate: [-0.05, 0.05],
        ignoreHole: true
    },
    "澎湖縣": {
        offlist: true
    },
    "金門縣": {
        offlist: true
    },
    "連江縣": {
        offlist: true
    }
};

// var textOffset = { '臺北市': [ 600 , 186 ], '基隆市': [ 692 , 237 ], '新北市': [ 602 , 272 ], '桃園市': [ 494 , 254 ], '宜蘭縣': [ 620 , 393 ], '新竹縣': [ 505 , 378 ], '新竹市': [ 432 , 322 ], '苗栗縣': [ 420 , 410 ], '臺中市': [ 420 , 480 ], '彰化縣': [ 315 , 557 ], '南投縣': [ 442 , 582 ], '花蓮縣': [ 562 , 616 ], '嘉義市': [ 415 , 682 ], '雲林縣': [ 300 , 618 ], '嘉義縣': [ 300 , 696 ], '臺南市': [ 280 , 790 ], '高雄市': [ 386 , 818 ], '臺東縣': [ 490 , 830 ], '屏東縣': [ 350 , 950 ], "澎湖縣": [ 200 , 100 ], "金門縣": [ 200 , 150 ] };
var textOffset = { 
    '臺北市': [ 275 ,  80 ], 
    '基隆市': [ 325 ,  95 ], 
    '新北市': [ 290 , 122 ], 
    '桃園市': [ 225 , 105 ], 
    '宜蘭縣': [ 285 , 180 ], 
    '新竹縣': [ 225 , 170 ], 
    '新竹市': [ 188 , 143 ], 
    '苗栗縣': [ 185 , 190 ], 
    '臺中市': [ 185 , 225 ], 
    '彰化縣': [ 125 , 260 ], 
    '南投縣': [ 195 , 280 ], 
    '花蓮縣': [ 260 , 300 ], 
    '嘉義市': [ 116 , 333 ], 
    '雲林縣': [ 115 , 300 ], 
    '嘉義縣': [ 155 , 340 ], 
    '臺南市': [ 105 , 390 ], 
    '高雄市': [ 160 , 410 ], 
    '臺東縣': [ 220 , 420 ], 
    '屏東縣': [ 145 , 470 ], 
    "澎湖縣": [ 50 ,  50 ], 
    "金門縣": [ 50 ,  80 ] 
};